In [1]:
import pandas as pd

In [2]:
dict_data={"a" : 1,"b":2,"c":3,"d":4 }

In [3]:
dict_data

{'a': 1, 'b': 2, 'c': 3, 'd': 4}

In [4]:
dict_data['d']

4

In [5]:
sr=pd.Series(dict_data)

In [6]:
sr

a    1
b    2
c    3
d    4
dtype: int64

In [7]:
print(type(sr))

<class 'pandas.core.series.Series'>

In [8]:
print(type(sr))
print("\n")
print(sr)

<class 'pandas.core.series.Series'>


a    1
b    2
c    3
d    4
dtype: int64

In [9]:
list_data=['2019-01-02',3.14,'ABC',100,"True"]

In [10]:
list_data

['2019-01-02', 3.14, 'ABC', 100, 'True']

In [11]:
sr=pd.Series(list_data)

In [12]:
sr

0    2019-01-02
1          3.14
2           ABC
3           100
4          True
dtype: object

In [13]:
idx=sr.index

In [14]:
val=sr.values

In [15]:
print(idx)
print(val)

RangeIndex(start=0, stop=5, step=1)
['2019-01-02' 3.14 'ABC' 100 'True']

In [16]:
tup_data=('영인','2010-05-01','여','True')

In [17]:
tup_data

('영인', '2010-05-01', '여', 'True')

In [18]:
sr=pd.Series(tup_data, index=['이름','생년월일','성별','학생여부'])

In [19]:
sr

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

In [20]:
print(sr['이름'])

영인

In [21]:
print(sr[0])

영인

In [22]:
print(sr['생년월일'])

2010-05-01

In [23]:
print(sr[[1,2]])

생년월일    2010-05-01
성별               여
dtype: object

In [24]:
print(sr[[1,2]])
print(sr[['생년월일','성별']])

생년월일    2010-05-01
성별               여
dtype: object
생년월일    2010-05-01
성별               여
dtype: object

In [25]:
print(sr[1:2])

생년월일    2010-05-01
dtype: object

In [62]:
sr[1:2]

생년월일    2010-05-01
dtype: object

In [64]:
print(sr['생년월일':'성별'])

생년월일    2010-05-01
성별               여
dtype: object

In [65]:
dict_data={"c0":[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9],'c3':[10,11,12],'c4':[13,14,15]}

In [66]:
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [67]:
df=pd.DataFrame(dict_data)

In [68]:
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [69]:
type(df)

pandas.core.frame.DataFrame

In [73]:
df=pd.DataFrame([[15,'남','덕영중'],[17,'여','수리중']],
                 index=['준서','예은'],
                columns=['나이','성별','학교'])

In [72]:
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [74]:
type(df)

pandas.core.frame.DataFrame

In [81]:
df.index=['학생1','학생2']
df.columns=['연령','남녀','소속']

In [108]:
df

    연령 남녀   소속
준서  15  남  덕영중
예은  17  여  수리중

In [84]:
print(df.index)
print(df.columns)

Index(['학생1', '학생2'], dtype='object')
Index(['연령', '남녀', '소속'], dtype='object')

In [117]:
df=pd.DataFrame([[15,'남','덕영중'],[17,'여','수리중']],
                 index=['준서','예은'],
                columns=['나이','성별','학교'])

In [118]:
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [119]:
df.rename(columns={'나이':'연령','성별':'성별','학교':'소속'},inplace=True)

In [121]:
df

    연령 성별   소속
준서  15  남  덕영중
예은  17  여  수리중

In [185]:
exam_data ={'수학':[90,80,70], '영어': [98,89,95], '음악': [85,95,100],'체육':[100,90,90]}

In [186]:
exam_data

{'수학': [90, 80, 70],
 '영어': [98, 89, 95],
 '음악': [85, 95, 100],
 '체육': [100, 90, 90]}

In [179]:
df=pd.DataFrame(exam_data,index=['서준','우현','인아'])

In [180]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [174]:
df.drop('서준',axis=0,inplace=True)

In [175]:
df.drop('인아',axis=0,inplace=True)

In [176]:
df

    수학  영어  음악  체육
우현  80  89  95  90

In [184]:
df.drop(['서준','인아','우현'],axis=0)

Empty DataFrame
Columns: [수학, 영어, 음악, 체육]
Index: []

In [187]:
ㅇㄹ

NameError: name 'ᄋᄅ' is not defined

In [188]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [190]:
df.drop('수학',axis=1,inplace=True)

In [191]:
df

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [192]:
df.drop(['체육','음악'],axis=1,inplace=True)

In [193]:
df

    영어
서준  98
우현  89
인아  95